Leafony/platformio-sample-projects/stm32/STM32_Logger_Beacon/src/main.cpp
//=====================================================================
//    (c) 2023 LEAFONY SYSTEMS Co., Ltd
//    Released under the MIT license
//    https://opensource.org/licenses/MIT
//
//      Rev.00 2023/02/01  First release
//=====================================================================
#include <Arduino.h>

#include <SoftwareSerial.h>
#include <Wire.h>
#include <EEPROM.h>

#include <STM32LowPower.h>
#include <STM32RTC.h>
#include <RTClib.h>

#include <TBGLib.h>

#include "parameters.h"
#include "sensors4.h"

//=====================================================================
// Sketch firmware version
//=====================================================================
const String FIRMWARE_VERSION = "2023.04.080";

//=====================================================================
// BLE Local device name
//=====================================================================
const String strDeviceNamePrefix = "Leaf_";
const String strDeviceNameUnique = "A";
String strDeviceName = strDeviceNamePrefix + strDeviceNameUnique;

//=====================================================================
// objects
//=====================================================================
// BLE
HardwareSerial Serialble(BLE_TX, BLE_RX);
BGLib ble112((HardwareSerial *)&Serialble, 0, 0);

// RTC
STM32RTC& rtc = STM32RTC::getInstance();

//=====================================================================
// Variables
//=====================================================================
float dataTemp = 0;
float dataHumid = 0;
float dataLight = 0;
float dataBatt = 0;

// BLE
volatile bool bSystemBootBle = false;
volatile uint8_t ble_state = BLE_STATE_STANDBY;
bool bBleConnected = false;
uint8_t mode = MODE_IDLE;

// EEPROM ring buffer
const uint8_t PACKET_LENGTH = 12;
uint32_t rb_addr = 0;  // ring buffer read address

// Settings saved in the EEPROM
uint16_t wake_intval       = DEFAULT_WAKE_INTERVAL;       // Wake time
uint16_t click_wake_intval = DEFAULT_CLICK_WAKE_INTERVAL; // Click interrupt wake time
uint16_t sleep_intval      = DEFAULT_SLEEP_INTERVAL;      // Sleep time
uint16_t sens_freq         = DEFAULT_SENS_FREQ;           // Sensor ON frequency
uint16_t save_freq         = DEFAULT_SAVE_FREQ;           // Data save frequency

//----------------------------------------------
// Prototypes
//----------------------------------------------
uint32_t getTimestamp();

void onBusy(void);
void onIdle(void);
void onTimeout(void);
void my_evt_gatt_server_attribute_value(const struct ble_msg_gatt_server_attribute_value_evt_t *msg);
void my_evt_le_connection_opend(const ble_msg_le_connection_opend_evt_t *msg);
void my_evt_le_connection_closed(const struct ble_msg_le_connection_closed_evt_t *msg);
void my_evt_system_boot(const ble_msg_system_boot_evt_t *msg);
void my_evt_system_awake(void);
void my_rsp_system_get_bt_address(const struct ble_msg_system_get_bt_address_rsp_t *msg);

// On-Clicked Interrupt
bool onClickedFlag = false;

//----------------------------------------------
// Accelerometer double-tap interrupt
//----------------------------------------------
void onClicked() {
  onClickedFlag = true;
}

//----------------------------------------------
// IO ports initialization
//----------------------------------------------
void setupPort() {
  pinMode(BLE_WAKEUP, OUTPUT);    // BLE Wakeup/Sleep
  digitalWrite(BLE_WAKEUP, HIGH); // BLE Wakeup
}

//-----------------------------------------------
// BLE initialization
//-----------------------------------------------
void setupBLE() {
  // set up internal status handlers
  ble112.onBusy = onBusy;
  ble112.onIdle = onIdle;
  ble112.onTimeout = onTimeout;

  // set up BGLib event handlers
  ble112.ble_evt_gatt_server_attribute_value = my_evt_gatt_server_attribute_value;
  ble112.ble_evt_le_connection_opend = my_evt_le_connection_opend;
  ble112.ble_evt_le_connection_closed = my_evt_le_connection_closed;
  ble112.ble_evt_system_boot = my_evt_system_boot;
  ble112.ble_evt_system_awake = my_evt_system_awake;
  ble112.ble_rsp_system_get_bt_address = my_rsp_system_get_bt_address;

  Serialble.begin(9600);

  uint8_t tm=0;
  while (!bSystemBootBle && tm <150){  // Wait for BLE Start-up
    ble112.checkActivity(100);
    tm++;
    delay(10);
  }

  // ble_rsp_system_get_bt_address handler is called.
  ble112.ble_cmd_system_get_bt_address();
  while (ble112.checkActivity(100));

  // set advertising parameters
  ble112.ble_cmd_le_gap_set_adv_parameters(MIN_ADV_INTVAL, MAX_ADV_INTVAL, 7); /* [BGLIB] <interval_min> <interval_max> <channel_map> */
  while (ble112.checkActivity(100));
}


//-----------------------------------------------
// BLE Advertising data configuration
//-----------------------------------------------
void StartAdvData() {
  uint16_t temp, humid, illum, battVolt;
  char userData[15];
  uint8_t dataLen;
  uint8_t stLen;
  uint8_t adv_data[25]; // advertising data (max 25bytes)
  uint8_t index = 0;

  //-------------------------
  // Sensors data
  //-------------------------
  temp     = (uint16_t)(dataTemp  * 256);
  humid    = (uint16_t)(dataHumid * 256);
  battVolt = (uint16_t)(dataBatt  * 256);
  illum    = (uint16_t)dataLight;

  //-------------------------
  // Advertising Packet
  //-------------------------
  // AD Structure 1 (Flags)
  adv_data[index++] = 0x02;                    // field length
  adv_data[index++] = BGLIB_GAP_AD_TYPE_FLAGS; // AD Type (Flags)
  adv_data[index++] = (1 << 1) | (1 << 2);     // LE General Discover Mode | BR/EDR Not Supported

  // AD Structure 2 (Complete Local Name)
  adv_data[index++] = strDeviceName.length() + 1;           // field length
  adv_data[index++] = BGLIB_GAP_AD_TYPE_LOCALNAME_COMPLETE; // AD Type (Complete Local Name)
  for (uint8_t i = 0; i < strDeviceName.length(); i++) {
    adv_data[index++] = strDeviceName.charAt(i); // Local Name
  }

  // AD Structure 3 (Manufacturer Specific Data)
  adv_data[index++] = 9;    // field lengh
  adv_data[index++] = 0xff; // AD Type (Manufacturer Specific Data)
  adv_data[index++] = (illum >> 8) & 0xFF;    // Illuminance (Upper)
  adv_data[index++] = illum & 0xFF;           // Illuminance (Lower)
  adv_data[index++] = (temp >> 8) & 0xFF;     // Temperature (Upper)
  adv_data[index++] = temp & 0xFF;            // Temperature (Lower)
  adv_data[index++] = (humid >> 8) & 0xFF;    // Humidity (Upper)
  adv_data[index++] = humid & 0xFF;           // Humidity (Lower)
  adv_data[index++] = (battVolt >> 8) & 0xFF; // Battery Voltage (Upper)
  adv_data[index++] = battVolt & 0xFF;        // Battery Voltage (Lower)

  // register advertising packet
  stLen = index;
  ble112.ble_cmd_le_gap_set_adv_data(SCAN_RSP_ADVERTISING_PACKETS, stLen, adv_data);
  while (ble112.checkActivity(1000));

